; domain
(define (domain emergencias-costs)
    (:requirements :strips :typing :action-costs)
    (:types
        location box bcontent person dron carrier num - object
    )

    (:functions
        (total-cost) - number
        (fly-cost ?l1 ?l2 - location) - number
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        (at-carrier ?c - carrier ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        ;; El dron ahora tiene un único brazo implícito
        (free ?d - dron)
        (carrying ?d - dron ?b - box)
        
        ;; Predicados para el transportador y los números
        (in-carrier ?b - box ?c - carrier)
        (boxes-in-carrier ?c - carrier ?n - num)
        (siguiente ?n1 - num ?n2 - num)
    )

    ;; Mueve solo al dron
    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (and (at-dron ?dron ?from) (free ?dron))
        :effect (and (at-dron ?dron ?to) (not (at-dron ?dron ?from))(increase (total-cost) (fly-cost ?from ?to)))
    )

    ;; Mueve al dron llevándose el transportador consigo
    (:action move-carrier
        :parameters (?from - location ?to - location ?dron - dron ?carrier - carrier)
        :precondition (and (at-dron ?dron ?from) (at-carrier ?carrier ?from) (free ?dron))
        :effect (and (at-dron ?dron ?to) (not (at-dron ?dron ?from)) 
                     (at-carrier ?carrier ?to) (not (at-carrier ?carrier ?from))(increase (total-cost) (fly-cost ?from ?to)))
    )

    ;; Recoge una caja del suelo (requiere tener el brazo libre)
    (:action pick
        :parameters (?box - box ?location - location ?dron - dron)
        :precondition (and (at-dron ?dron ?location) (at-box ?box ?location) (free ?dron))
        :effect (and (not (at-box ?box ?location)) (not (free ?dron)) (carrying ?dron ?box)(increase (total-cost) 1))
    )

    ;; Entrega una caja a una persona
    (:action leave
        :parameters (?box - box ?location - location ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location) (carrying ?dron ?box) (at-person ?person ?location) (box-has ?box ?content))
        :effect (and (at-box ?box ?location) (free ?dron) (not (carrying ?dron ?box)) (person-has ?person ?content) (not (box-has ?box ?content)) (increase (total-cost) 1))
    )

    ;; Mete una caja en el transportador (Suma 1)
    (:action put-in-carrier
        :parameters (?box - box ?location - location ?dron - dron ?carrier - carrier ?n1 - num ?n2 - num)
        :precondition (and (at-dron ?dron ?location) (at-carrier ?carrier ?location) (carrying ?dron ?box) 
                           (boxes-in-carrier ?carrier ?n1) (siguiente ?n1 ?n2))
        :effect (and (not (carrying ?dron ?box)) (free ?dron) (in-carrier ?box ?carrier) 
                     (not (boxes-in-carrier ?carrier ?n1)) (boxes-in-carrier ?carrier ?n2)(increase (total-cost) 1))
    )

    ;; Saca una caja del transportador (Resta 1)
    (:action take-from-carrier
        :parameters (?box - box ?location - location ?dron - dron ?carrier - carrier ?n1 - num ?n2 - num)
        :precondition (and (at-dron ?dron ?location) (at-carrier ?carrier ?location) (free ?dron) (in-carrier ?box ?carrier) 
                           (boxes-in-carrier ?carrier ?n2) (siguiente ?n1 ?n2))
        :effect (and (carrying ?dron ?box) (not (free ?dron)) (not (in-carrier ?box ?carrier)) 
                     (not (boxes-in-carrier ?carrier ?n2)) (boxes-in-carrier ?carrier ?n1)(increase (total-cost) 1))
    )
)

; problem
(define (problem problem_size8)
(:domain emergencias-costs)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 - location
	box1 box2 box3 box4 box5 box6 box7 box8 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 - person
	carrier1 - carrier
	n0 n1 n2 n3 n4 - num
)

(:init
	(= (total-cost) 0)
	(= (fly-cost deposito refugio1) 2)
	(= (fly-cost deposito refugio2) 2)
	(= (fly-cost deposito refugio3) 15)
	(= (fly-cost deposito refugio4) 20)
	(= (fly-cost deposito refugio5) 18)
	(= (fly-cost deposito refugio6) 18)
	(= (fly-cost deposito refugio7) 2)
	(= (fly-cost deposito refugio8) 10)
	(= (fly-cost refugio1 deposito) 18)
	(= (fly-cost refugio1 refugio2) 4)
	(= (fly-cost refugio1 refugio3) 8)
	(= (fly-cost refugio1 refugio4) 20)
	(= (fly-cost refugio1 refugio5) 7)
	(= (fly-cost refugio1 refugio6) 4)
	(= (fly-cost refugio1 refugio7) 11)
	(= (fly-cost refugio1 refugio8) 4)
	(= (fly-cost refugio2 deposito) 3)
	(= (fly-cost refugio2 refugio1) 18)
	(= (fly-cost refugio2 refugio3) 13)
	(= (fly-cost refugio2 refugio4) 6)
	(= (fly-cost refugio2 refugio5) 11)
	(= (fly-cost refugio2 refugio6) 16)
	(= (fly-cost refugio2 refugio7) 10)
	(= (fly-cost refugio2 refugio8) 18)
	(= (fly-cost refugio3 deposito) 4)
	(= (fly-cost refugio3 refugio1) 12)
	(= (fly-cost refugio3 refugio2) 10)
	(= (fly-cost refugio3 refugio4) 9)
	(= (fly-cost refugio3 refugio5) 5)
	(= (fly-cost refugio3 refugio6) 13)
	(= (fly-cost refugio3 refugio7) 4)
	(= (fly-cost refugio3 refugio8) 19)
	(= (fly-cost refugio4 deposito) 2)
	(= (fly-cost refugio4 refugio1) 1)
	(= (fly-cost refugio4 refugio2) 16)
	(= (fly-cost refugio4 refugio3) 20)
	(= (fly-cost refugio4 refugio5) 8)
	(= (fly-cost refugio4 refugio6) 20)
	(= (fly-cost refugio4 refugio7) 20)
	(= (fly-cost refugio4 refugio8) 2)
	(= (fly-cost refugio5 deposito) 13)
	(= (fly-cost refugio5 refugio1) 14)
	(= (fly-cost refugio5 refugio2) 12)
	(= (fly-cost refugio5 refugio3) 9)
	(= (fly-cost refugio5 refugio4) 6)
	(= (fly-cost refugio5 refugio6) 14)
	(= (fly-cost refugio5 refugio7) 9)
	(= (fly-cost refugio5 refugio8) 4)
	(= (fly-cost refugio6 deposito) 9)
	(= (fly-cost refugio6 refugio1) 17)
	(= (fly-cost refugio6 refugio2) 15)
	(= (fly-cost refugio6 refugio3) 7)
	(= (fly-cost refugio6 refugio4) 12)
	(= (fly-cost refugio6 refugio5) 19)
	(= (fly-cost refugio6 refugio7) 7)
	(= (fly-cost refugio6 refugio8) 17)
	(= (fly-cost refugio7 deposito) 5)
	(= (fly-cost refugio7 refugio1) 12)
	(= (fly-cost refugio7 refugio2) 16)
	(= (fly-cost refugio7 refugio3) 17)
	(= (fly-cost refugio7 refugio4) 2)
	(= (fly-cost refugio7 refugio5) 3)
	(= (fly-cost refugio7 refugio6) 1)
	(= (fly-cost refugio7 refugio8) 12)
	(= (fly-cost refugio8 deposito) 19)
	(= (fly-cost refugio8 refugio1) 11)
	(= (fly-cost refugio8 refugio2) 15)
	(= (fly-cost refugio8 refugio3) 16)
	(= (fly-cost refugio8 refugio4) 20)
	(= (fly-cost refugio8 refugio5) 8)
	(= (fly-cost refugio8 refugio6) 3)
	(= (fly-cost refugio8 refugio7) 5)
	(siguiente n0 n1)
	(siguiente n1 n2)
	(siguiente n2 n3)
	(siguiente n3 n4)
	(at-dron dron1 deposito)
	(free dron1)
	(at-carrier carrier1 deposito)
	(boxes-in-carrier carrier1 n0)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 medicina)
	(at-person person1 refugio7)
	(at-person person2 refugio6)
	(at-person person3 refugio2)
	(at-person person4 refugio1)
	(at-person person5 refugio7)
	(at-person person6 refugio3)
	(at-person person7 refugio8)
	(at-person person8 refugio7)
)

(:goal (and
	(person-has person1 comida)
	(person-has person1 medicina)
	(person-has person3 comida)
	(person-has person4 comida)
	(person-has person5 comida)
	(person-has person6 comida)
	(person-has person7 comida)
	(person-has person8 comida)
))
(:metric minimize (total-cost))
)

; plan
1. (pick box8 deposito dron1)
   deleted: (at-box box8 deposito) (free dron1)
   added: (carrying dron1 box8)
   goals met: 0 of 8
2. (put-in-carrier box8 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box8) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box8 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 0 of 8
3. (move-carrier deposito refugio7 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio7) (at-carrier carrier1 refugio7)
   goals met: 0 of 8
4. (take-from-carrier box8 refugio7 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box8 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box8) (boxes-in-carrier carrier1 n0)
   goals met: 0 of 8
5. (leave box8 refugio7 dron1 person1 medicina)
   deleted: (carrying dron1 box8) (box-has box8 medicina)
   added: (at-box box8 refugio7) (free dron1) (person-has person1 medicina)
   goals met: 1 of 8
6. (move-carrier refugio7 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio7) (at-carrier carrier1 refugio7)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 1 of 8
7. (pick box1 deposito dron1)
   deleted: (at-box box1 deposito) (free dron1)
   added: (carrying dron1 box1)
   goals met: 1 of 8
8. (put-in-carrier box1 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box1) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box1 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 1 of 8
9. (move-carrier deposito refugio2 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio2) (at-carrier carrier1 refugio2)
   goals met: 1 of 8
10. (take-from-carrier box1 refugio2 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box1 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box1) (boxes-in-carrier carrier1 n0)
   goals met: 1 of 8
11. (leave box1 refugio2 dron1 person3 comida)
   deleted: (carrying dron1 box1) (box-has box1 comida)
   added: (at-box box1 refugio2) (free dron1) (person-has person3 comida)
   goals met: 2 of 8
12. (move-carrier refugio2 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio2) (at-carrier carrier1 refugio2)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 2 of 8
13. (pick box2 deposito dron1)
   deleted: (at-box box2 deposito) (free dron1)
   added: (carrying dron1 box2)
   goals met: 2 of 8
14. (put-in-carrier box2 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box2) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box2 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 2 of 8
15. (move-carrier deposito refugio1 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio1) (at-carrier carrier1 refugio1)
   goals met: 2 of 8
16. (take-from-carrier box2 refugio1 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box2 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box2) (boxes-in-carrier carrier1 n0)
   goals met: 2 of 8
17. (leave box2 refugio1 dron1 person4 comida)
   deleted: (carrying dron1 box2) (box-has box2 comida)
   added: (at-box box2 refugio1) (free dron1) (person-has person4 comida)
   goals met: 3 of 8
18. (move-carrier refugio1 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio1) (at-carrier carrier1 refugio1)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 3 of 8
19. (pick box3 deposito dron1)
   deleted: (at-box box3 deposito) (free dron1)
   added: (carrying dron1 box3)
   goals met: 3 of 8
20. (put-in-carrier box3 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box3) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box3 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 3 of 8
21. (move-carrier deposito refugio3 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio3) (at-carrier carrier1 refugio3)
   goals met: 3 of 8
22. (take-from-carrier box3 refugio3 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box3 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box3) (boxes-in-carrier carrier1 n0)
   goals met: 3 of 8
23. (leave box3 refugio3 dron1 person6 comida)
   deleted: (carrying dron1 box3) (box-has box3 comida)
   added: (at-box box3 refugio3) (free dron1) (person-has person6 comida)
   goals met: 4 of 8
24. (move-carrier refugio3 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio3) (at-carrier carrier1 refugio3)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 4 of 8
25. (pick box4 deposito dron1)
   deleted: (at-box box4 deposito) (free dron1)
   added: (carrying dron1 box4)
   goals met: 4 of 8
26. (put-in-carrier box4 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box4) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box4 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 4 of 8
27. (move-carrier deposito refugio8 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio8) (at-carrier carrier1 refugio8)
   goals met: 4 of 8
28. (take-from-carrier box4 refugio8 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box4 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box4) (boxes-in-carrier carrier1 n0)
   goals met: 4 of 8
29. (leave box4 refugio8 dron1 person7 comida)
   deleted: (carrying dron1 box4) (box-has box4 comida)
   added: (at-box box4 refugio8) (free dron1) (person-has person7 comida)
   goals met: 5 of 8
30. (move-carrier refugio8 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio8) (at-carrier carrier1 refugio8)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 5 of 8
31. (pick box5 deposito dron1)
   deleted: (at-box box5 deposito) (free dron1)
   added: (carrying dron1 box5)
   goals met: 5 of 8
32. (put-in-carrier box5 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box5) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box5 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 5 of 8
33. (move-carrier deposito refugio7 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio7) (at-carrier carrier1 refugio7)
   goals met: 5 of 8
34. (take-from-carrier box5 refugio7 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box5 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box5) (boxes-in-carrier carrier1 n0)
   goals met: 5 of 8
35. (leave box5 refugio7 dron1 person1 comida)
   deleted: (carrying dron1 box5) (box-has box5 comida)
   added: (at-box box5 refugio7) (free dron1) (person-has person1 comida)
   goals met: 6 of 8
36. (move-carrier refugio7 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio7) (at-carrier carrier1 refugio7)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 6 of 8
37. (pick box6 deposito dron1)
   deleted: (at-box box6 deposito) (free dron1)
   added: (carrying dron1 box6)
   goals met: 6 of 8
38. (put-in-carrier box6 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box6) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box6 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 6 of 8
39. (move-carrier deposito refugio7 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio7) (at-carrier carrier1 refugio7)
   goals met: 6 of 8
40. (take-from-carrier box6 refugio7 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box6 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box6) (boxes-in-carrier carrier1 n0)
   goals met: 6 of 8
41. (leave box6 refugio7 dron1 person5 comida)
   deleted: (carrying dron1 box6) (box-has box6 comida)
   added: (at-box box6 refugio7) (free dron1) (person-has person5 comida)
   goals met: 7 of 8
42. (move-carrier refugio7 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio7) (at-carrier carrier1 refugio7)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 7 of 8
43. (pick box7 deposito dron1)
   deleted: (at-box box7 deposito) (free dron1)
   added: (carrying dron1 box7)
   goals met: 7 of 8
44. (put-in-carrier box7 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box7) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box7 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 7 of 8
45. (move-carrier deposito refugio7 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio7) (at-carrier carrier1 refugio7)
   goals met: 7 of 8
46. (take-from-carrier box7 refugio7 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box7 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box7) (boxes-in-carrier carrier1 n0)
   goals met: 7 of 8
47. (leave box7 refugio7 dron1 person8 comida)
   deleted: (carrying dron1 box7) (box-has box7 comida)
   added: (at-box box7 refugio7) (free dron1) (person-has person8 comida)
   goals met: 8 of 8
